package com.skyteam.animalshelterbot.listener.constants;

public class ConstantsForBotMessages {
    /**
     * Выбор типа приюта
     */
    public final static String SHELTER_TYPE_SELECT = "Привет, выберите тип приюта ";
    /**
     * Приветственное меню для приюта собак
     */
    public final static String DOG_SHELTER_WELCOME = "Вас приветствует приют для собак. Чем я могу Вам помочь? ";
    /**
     * Приветственное меню для приюта кошек
     */
    public final static String CAT_SHELTER_WELCOME = "Вас приветствует приют для кошек. Чем я могу Вам помочь? ";
    /**
     * Общая информация о приюте для кошек.
     */
    public static final String INFO_ABOUT_CAT_SHELTER = "Кошкин дом - самый лучший приют для котиков. Мы заботимся о своих пушистых воспитанниках и хотим быть уверены, что каждый получит теплые заботливые руки.";
    /**
     * Общая информация о приюте для собак.
     */
    public static final String INFO_ABOUT_DOG_SHELTER = "Пёс хауз - самый лучший приют для лучших друзей человека. Мы заботимся о своих пушистых воспитанниках и хотим быть уверены, что каждый получит теплые заботливые руки.";
    /**
     * Расписание и адрес приюта для кошек.
     */
    public static final String SCHEDULE_AND_ADDRESS_CAT_SHELTER = "Мы работаем без перерывов и выходных. \nНаш адрес: г.Москва, ул. Кошкина, д.1";
    /**
     * Расписание и адрес приюта для собак.
     */
    public static final String SCHEDULE_AND_ADDRESS_DOG_SHELTER = "Мы работаем без перерывов и выходных. \nНаш адрес: г.Москва, ул. Собакина, д.1";
    /**
     * Информация о способе подачи заявки на пропуск в приют для кошек.
     */
    public static final String PASS_INFORMATION_CAT_SHELTER = "Телефон для подачи заявки на пропуск. 0-000-000-00-00";
    /**
     * Информация о способе подачи заявки на пропуск в приют для собак.
     */
    public static final String PASS_INFORMATION_DOG_SHELTER = "Телефон для подачи заявки на пропуск. 1-111-111-11-11";
    /**
     * Информация о правилах безопасноти на территории приюта для кошек.
     */
    public static final String SAFETY_INFORMATION_CAT_SHELTER = "Во время нахождения на территории приюта запрещено: \n- прикасаться к животным без разрешения волонтера;\n- давать животным любую пищу!";
    /**
     * Информация о правилах безопасноти на территории приюта для собак.
     */
    public static final String SAFETY_INFORMATION_DOG_SHELTER = "Во время нахождения на территории приюта запрещено: \n- прикасаться к животным без разрешения волонтера; \n- давать животным любую пищу!";
    /**
     * Команды и описание для выбора пользователем приюта для кошек.
     */
    public static final String HELP_CATS_SHELTER = "Для получения дополнительной информации о приюте введите одну из следующих команд:\n" +
            "/info_cat_shelter - для получения информации о приюте\n" +
            "/schedule_and_address_cat_shelter - для получения информации о расписании и адресе\n" +
            "/pass_information_cat_shelter - информация о подаче заявки на пропуск\n" +
            "/safety_information_cat_shelter - информация о правилах безопасности на территории приюта";
    /**
     * Команды и описание для выбора пользователем приюта для собак.
     */
    public static final String HELP_DOGS_SHELTER = "Для получения дополнительной информации о приюте введите одну из следующих команд:\n" +
            "/info_dog_shelter - для получения информации о приюте\n" +
            "/schedule_and_address_dog_shelter - для получения информации о расписании и адресе\n" +
            "/pass_information_dog_shelter - информация о подаче заявки на пропуск\n" +
            "/safety_information_dog_shelter - информация о правилах безопасности на территории приюта";
}
